mdmfile/src/Catalogs/мдмТочкиЗавершение/мдмТочкиЗавершение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мдмТочкиЗавершение</name>
  <owners>Catalog.мдмБизнесПроцессы</owners>
  <attributes>
    <name>ПриЗавершении</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Входы</name>
    <attributes>
      <name>Точка</name>
      <type>
        <types>DefinedType.мдмТочкаБизнесПроцесса</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

mdmfile/src/Catalogs/мдмТочкиЗавершение/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытийФормы

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	мдмБизнесПроцессыСобытия.ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция ПолучитьПоИмени(Имя, БизнесПроцесс) Экспорт
	
	Возврат ЭтотОбъект().НайтиПоРеквизиту("Имя", Имя,, БизнесПроцесс);
	
КонецФункции

Функция СоздатьОбновитьТочки(Точка, Элемент, БизнесПроцесс) Экспорт
	
	Возврат мдмТочкиБизнесПроцесса.СоздатьОбновитьТочки(ЭтотОбъект(), Точка, Элемент, БизнесПроцесс);
	
КонецФункции	

Функция ОбновитьСвязиТочки(Точка, ТаблицаСвязей) Экспорт

	Возврат мдмТочкиБизнесПроцесса.ОбновитьСвязиТочки(ЭтотОбъект(), Точка, ТаблицаСвязей);
	
КонецФункции	

Функция ЭтотОбъект() Экспорт
	
	Возврат Справочники.мдмТочкиЗавершение;
	
КонецФункции	

Функция ЕстьВходы() Экспорт
	Возврат Истина;
КонецФункции	

Функция ЕстьВыходы() Экспорт
	Возврат Ложь;
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
